admin/models/Foto.php

    public static function findByUser($usuario){
        $model = Foto::find()->where(['usu_id' =>$usuario])->orderBy('foto_nome')->all();
---
SELECT * FROM `foto` WHERE `usu_id` IS NULL ORDER BY `foto_nome`