admin/models/Usuario.php

SELECT * FROM `usuario` WHERE `usu_id`=2
---
    public static function findIdentity($id)
    {
        return static::findOne($id);

SELECT * FROM `usuario` WHERE (`usu_login`='admin') AND (`ace_id`=1)
---
    public static function findByUsername($usuario,$acesso = null){
        if($acesso != null) {
            return self::findOne(['usu_login' => $usuario, 'ace_id' => $acesso]);